{
    "version": "https://jsonfeed.org/version/1",
    "title": "Grand Cross Guide",
    "description": "",
    "home_page_url": "https://miyeonlin.github.io/grandcrossguide",
    "feed_url": "https://miyeonlin.github.io/grandcrossguide/feed.json",
    "user_comment": "",
    "author": {
        "name": "Thundas"
    },
    "items": [
        {
            "id": "https://miyeonlin.github.io/grandcrossguide/grand-cross-guide.html",
            "url": "https://miyeonlin.github.io/grandcrossguide/grand-cross-guide.html",
            "title": "Grand Cross Guide (ThewizardTH)",
            "summary": "This Guide is for members of the alliance ThewizardTH in kingdom #53, please do not copy, hours was spent making this from translation. To begin, when you initially set up your account, continue advancing through chapters until you attain castle level 21. The rationale behind&hellip;",
            "content_html": "<div class=\"container\">\n<p>This Guide is for members of the alliance ThewizardTH in kingdom #53, please do not copy, hours was spent making this from translation.</p>\n<h1>How should I build my account when I first create it?</h1>\n<p>To begin, when you initially set up your account, continue advancing through chapters until you attain castle level 21. The rationale behind this is that at level 21, the number of deployable troops increases to 5+1.</p>\n<p>\"5+1\" refers to a troop composition breakdown:</p>\n<ul>\n<li>\n<p>The \"5\" represents troops that are capable of tasks such as gathering, hunting, and supporting alliance buildings and structures. A notable feature is that these troops have the ability to move to another gathering point once they complete their gathering task and start returning.</p>\n</li>\n<li>\n<p>The \"1\" corresponds to the troop positioned within the small green square located in the top-right corner. This troop is exclusively designed for gathering purposes. Notably, this troop cannot stop its action once it has finished gathering and starts returning.</p>\n</li>\n</ul>\n<h1>Which heroes should I raise?</h1>\n<p>Initially, it's important to note that there exist different categories of heroes. These categories encompass Hunting, Gathering, Combat, Arena, Field Battle, Monster Subjugation, and several others. The multitude of hero types makes it somewhat challenging for me to cover each one extensively, but I'll endeavor to provide comprehensive explanations to the best of my ability.</p>\n<p>To begin, a foundational understanding is that heroes attain the capability to equip officers once they achieve level 20 and are promoted to a three-star rating.</p>\n<p>When it comes to heroes, there are two primary distinctions:</p>\n<ol>\n<li>\n<p>Main hero: Both skills and talents have an effect.</p>\n</li>\n<li>\n<p>Sub hero: Only skills come into play.</p>\n</li>\n</ol>\n<p>Please retain the above information for your reference.</p>\n<h2>Hunting | Gathering</h2>\n<p><strong><span style=\"text-decoration: underline;\">Legendary | Legendary</span></strong></p>\n<p>Secmeth | Adriene</p>\n<p>Claudia |</p>\n<p><strong><span style=\"text-decoration: underline;\">Exclusive | Exclusive</span></strong></p>\n<p>Aktarus | Kaya</p>\n<p>Valkyrie | Natalie</p>\n<p>Helena |</p>\n<p>Ranek |</p>\n<p>Rare | Rare</p>\n<p>Angus | Ilian</p>\n<p><strong><span style=\"text-decoration: underline;\">Advanced | Advanced</span></strong></p>\n<p>Lulu |</p>\n<p>Larie |</p>\n<p>Sophia |</p>\n<h2>Recommended Combinations (Contains subjective opinions)</h2>\n<p>(Note: Please disregard the distinction between main and sub heroes that I arbitrarily mentioned. Instead, select the hero with talents that align with the intended purpose of deploying this troop as the main hero.)</p>\n<h3>Infantry</h3>\n<p>Kallope + Erdall (Strongest garrison deck)</p>\n<p>Kallope + Arthur</p>\n<p>Kallope + Eren</p>\n<p>Kallope + Destina (Recommended for garrison)</p>\n<p>Kallope + Corvo</p>\n<p>Arthur + Corvo</p>\n<p>Arthur + Claudia</p>\n<p>Janette + Above heroes</p>\n<p>Can mix and match (But Kallope is too good)</p>\n<h3>Archers</h3>\n<p>Haemosu + Elisha</p>\n<p>Haemosu + Melibee</p>\n<p>Jangseung + Elisha (To use skills a lot)</p>\n<p>Jangseung + Melibee (To use skills a lot)\\</p>\n<p>Jangseung + Finn (To use skills a lot)</p>\n<p>Janette + Above heroes</p>\n<p>(Hiedo is decent too..)</p>\n<h3>Cavalry</h3>\n<p>Beom + Newmar (Whale slaying deck), (Rally deck)</p>\n<p>Beom + Isaac</p>\n<p>Newmar + Isaac</p>\n<p>Beom + Janette</p>\n<p>Gallahad + Bella (Gathering kill)</p>\n<p>Kaila + Ilian (Fast speed)</p>\n<h2>Recommended heroes for monster subjugation</h2>\n<p><strong><span style=\"text-decoration: underline;\">Legendary | Exclusive</span></strong></p>\n<p>Elisha | Ranek</p>\n<p>Melibee | Haemosu</p>\n<p>Isaac | Jangseung</p>\n<p>Helga | Bella</p>\n<p>Newmar |</p>\n<p>Beom |</p>\n<p>Secmeth |</p>\n<p>Bellimaur |</p>\n<p>Corvo |</p>\n<p>Karma |</p>\n<p>As previously noted, it's essential to develop all heroes to some extent. However, there are certain heroes that are infrequently utilized, such as Kainess and Mua. Heroes that should be prioritized for initial development include all heroes except those mentioned earlier. Heroes that should be invested in consistently until completion comprise Kallope, Janette, Haemosu, Jangseung, the seven gathering heroes, Kaila (for increased movement speed), and Eren (the most cost-efficient defensive hero).</p>\n<h1>How should I distribute hero talents?</h1>\n<p>This aspect often piques the curiosity of many individuals. While I may not excel in explanations, I will certainly make every effort to provide a clear understanding.</p>\n<p><strong><span style=\"text-decoration: underline;\">Gathering heroes </span></strong></p>\n<p>Analyzing Kaya's skills, it's apparent that she possesses abilities tied to both ore and food. Given this, when allocating talents, it's advisable to concentrate on enhancing food and ore production, ultimately reaching the pinnacle of the gathering capacity talent. Achieving level 35 should suffice for this purpose.</p>\n<p>However, should you desire to maximize her potential, there's an additional gathering speed talent among the upper-tier abilities. By investing talent points into this aspect and reaching level 44, you can achieve her optimal potential. Therefore, when distributing talents for gathering heroes like Kaya, follow this approach.</p>\n<p><strong><span style=\"text-decoration: underline;\">Combat heroes</span></strong></p>\n</div>\n<div class=\"container\">\n<p>Begin by contrasting the talents located at the extreme ends of both the upper and lower talent lines.</p>\n<p>Once you've made your selection between the two, proceed to pick one talent to enhance within each segment of that chosen line. Incrementally raise each chosen talent by 3 levels before transitioning to the next segment.</p>\n<p>Following this, apply the same methodology to the other talent line until you eventually unlock the talents situated at the furthest extremities of both lines.</p>\n<p><strong><span style=\"text-decoration: underline;\">Stat sections</span></strong></p>\n<p>- Infantry - Defense</p>\n<p>- Cavalry - Attack or Health</p>\n<p>- Archers - Attack</p>\n<p>For heroes with exceptionally powerful active skills, raise talent related to skills.</p>\n<p><strong><span style=\"text-decoration: underline;\">Special notes</span></strong></p>\n<p>Kaila: As the hero boasting the highest speed, it's recommended to enhance all talents linked to march speed within her talent tree.</p>\n<p>Jangseung: Certain heroes, like Jangseung, are specialized in mana utilization. Their talent trees are abundant in talents related to mana. Consider these heroes as \"skill spammers,\" effectively paired with heroes possessing potent active skills.</p>\n<p>You have the flexibility to develop them in various ways contingent on the circumstances. For instance, when paired with Secmeth, you can prioritize hunting-related talents if you plan to engage in prolonged hunting endeavors. Conversely, if you anticipate participating in warfare, you can shift focus to attack-related talents. This adaptability allows you to tailor their development effectively based on the situation.</p>\n<h1>What is the proper direction for construction and research?</h1>\n<p>Construction: Prioritize the initial advancement of your castle to level 21, and then proceed with a more gradual pace. It's crucial to maintain parity between the castle level and the levels of both the hospital and castle walls moving forward.</p>\n<p>Research: Begin with upgrading the tiers in your research efforts. Achieving tier 4 should be relatively straightforward, while reaching tier 5 might pose challenges for free players. Therefore, it's advisable to aim for tier 4 initially and subsequently focus on mastering the economic aspects. Farming becomes a crucial strategy for us, considering the opportunities it presents.</p>\n<p>※ For both construction and research endeavors, it's essential to accumulate strength patiently until suitable events occur. Such events occur more frequently than one might anticipate.</p>\n<h1>Small but useful tips</h1>\n<p>Avoid completely filling up your action points; once they are full, promptly utilize some for hunting. It's important to note that natural recovery doesn't occur when your points are already at capacity.</p>\n<p>Cultivate the practice of accumulating resources, except for gacha prayer items.</p>\n<p>Events such as gathering, hunting monsters, boosting research and construction contributions, and soldier training occur regularly. Capitalize on these opportunities by utilizing the resources you've accumulated to achieve higher ranks and attain enhanced rewards.</p>\n<p>When engaged in construction, research, or training activities, remember to seek assistance from your alliance members. Prioritize acquiring all available help before resorting to using accelerators or waiting periods.</p>\n<h1><strong>Control tips for world map.</strong></h1>\n<p>On PC: To select all troops, either double click the troop in the top right corner or press Ctrl + A. You can also use Ctrl + 1~5 to individually select specific groups of troops. Moving troops and initiating attacks can be done through dragging or right-clicking.</p>\n<p>On Mobile: To select all troops in the current screen, double click the troop in the top right corner.</p>\n<h1>Tips &amp; Tricks</h1>\n<ul>\n<li>When engaging in monster hunting, if our hero's AOE skill aggroes another passing monster, you'll still receive experience points even if that secondary monster is eliminated. However, this action does consume action points. This enables the possibility of herd hunting.</li>\n<li>Activities like Arena and Monster Subjugation reset daily at 0:00 UTC. To maximize your benefits, it's recommended to participate just before the reset time. (Tomorrow's version of \"me\" will be stronger than today's.)</li>\n<li>Joining an alliance is crucial. If possible, consider joining a strong alliance to reap the benefits offered by paying members.</li>\n<li>When healing troops at the hospital, it's advisable not to overly rely on assistance from alliance members. Keep an eye on the thermometer at the top left corner; excessive use of assistance can lead to the nurses becoming overloaded and the hospital going into an overload state. This might hinder your ability to receive alliance help when you truly need it in the future.</li>\n<li>When special packages appear, pay attention to the color indicators - red signifies a definite buy, while yellow suggests a purchase that can be considered. As a free player, refrain from purchasing anything else.</li>\n<li>The port offers resources at 6.00 PM UTC and 0.00 UTC daily. Utilize your gems to acquire all available resources there. Additionally, you might contemplate purchasing around 80-90% of resources or accelerators.</li>\n<li>In the VIP shop, invest your gems in purchasing all available resources. The 8-hour accelerators priced at 240 diamonds are highly efficient and well worth acquiring.</li>\n<li>When engaging in monster hunting, it's advisable to assemble a team of heroes that excel in single-target damage or lack AOE skills. The presence of AOE heroes can complicate matters.</li>\n<li>When ascending the tower, a common strategy involves utilizing a swift cavalry hero like Kaila to draw significant attention while maneuvering around. Meanwhile, your other heroes can eliminate all non-boss enemies. Subsequently, all heroes converge to collectively engage the boss.</li>\n<li>Although gems have limited utility, investing them in VIP benefits is strongly recommended. VIP level 8 provides the advantage of selecting 1 hero yellow manastone stone daily. VIP level 11 offers an astounding 2 free hero yellow manastones daily, which is truly remarkable!</li>\n<li>In terms of talents, achieving the ability to max out both the upper and lower talent lines is crucial. By level 59, increment each segment by 3 levels before proceeding to reach the final talents situated at the extremes of both lines.</li>\n</ul>\n<h1>★★★★★ (Important)</h1>\n<p> </p>\nWhen engaging in monster hunting, utilizing 5 troops against a single monster proves significantly more effective than using 1 troop against a monster. If a single monster yields 100 experience points, with 5 troops focusing on that monster, each troop gains 100 exp, resulting in a 5x increase. The action points consumed also multiply by 5. Although this approach consumes more action points, it substantially reduces the fighting duration and casualties, yielding long-term benefits. Moreover, rewards also scale based on troop count.<br>\n<ul>\n<li>Avoid upgrading recruited soldiers you already possess; they become highly valuable during wars. Retain them for gathering purposes as well, but refrain from intentionally recruiting more of them.</li>\n</ul>\n<p>This tip is directed towards alliance leaders, specifically for Aktarus events:</p>\n<ol>\n<li>Utilize the rally feature.</li>\n<li>Assemble an army consisting entirely of cavalry units.</li>\n<li>Set the rally time to 5 minutes.</li>\n<li>Rally the nearest Aktarus to your castle.</li>\n<li>Re-rally troops upon their return, rather than allowing them to return automatically.</li>\n<li>If alliance members have a considerable amount of march time remaining, consider removing them from the rally.</li>\n<li>Keep in mind that Aktarus events are based on UTC time.</li>\n<li>Utilize event stones exclusively to enhance Aktarus' skills.</li>\n</ol>\n<ul>\n<li>Passes hold significant importance; if a pass separates your troops and castle, they cannot return without facing casualties or employing specific lord skills.</li>\n<li>Reserve gathering aptitude stones exclusively for enhancing Kaya and Natalie's skills.</li>\n<li>Once the world map becomes accessible, make sure to zoom out entirely and click on the globe icon situated at the bottom right corner. This allows you to explore other servers and migrate kingdoms.</li>\n<li>Alliance members have the capability to provide support for building captures and upgrades. Up to 2 million troops can be dispatched, and additional support accelerates capture time. Extensive support significantly contributes to alliance advancement.</li>\n<li>Purchasing the $15 season pass at Larrie's manor offers excellent value; I highly recommend it.</li>\n<li>If mines or embassies do not appear initially while progressing through chapters, there's no need to worry. Simply disregard them and they will naturally become accessible later in the game.</li>\n<li>Alliance territory towers provide a 25% boost to gathering speed. To optimize this benefit, it's wise to avoid having too many player castles near the towers. This encourages more gathering plots to respawn effectively.</li>\n</ul>\n<p>Commonly used lord skills:</p>\n<p>Arthur (Extra attack)</p>\n<p>Natalie (Force return all troops)</p>\n<p>Finn (Force return selected troop)</p>\n<p>Aktarus (Reduce damage taken from monsters)</p>\n<ul>\n<li>Regarding Larrie's manor, if you intend to purchase the $15 pack, it's advisable to do so early in the game. This will provide you with an additional experience bonus, allowing you to attain higher levels and consequently receive improved rewards.</li>\n</ul>\n<h1>★★★★★(Important)</h1>\n<p>Field bosses:</p>\n<p>Zone 1: Binzy / Level 1 Inferno</p>\n<p>Zone 2: Bit / Steve / Level 2 Inferno</p>\n<p>Zone 3: Level 3 Inferno</p>\n<p>These offer highly rewarding benefits that are quite enticing. It's crucial to actively engage in hunting them. As previously mentioned, employing multiple troops significantly amplifies the rewards you receive. Timely raids on these targets are essential, especially when collaborating with a strong alliance. This approach serves as the primary means for free players to effectively compete with those who invest financially.</p>\n<ul>\n<li>During hunting, it's recommended to assemble single target damage heroes without AOE skills to avoid complicating matters with AOE abilities.</li>\n<li>Regarding titans - they naturally unlock at 1.8 million power. However, the cavalry titan Edock initially begins with injuries. Utilize cavalry materials from the titan workshop to heal him. It's advisable to heal him as you'll need around 10-15 half-health titans to defeat level 1 Inferno bosses later on.</li>\n<li>For alliance missions - R5 or R4 can assign these daily at 0.00 UTC after the reset. Select missions that align with ongoing events for concurrent progress. Avoid fortress assaults without associated events as they are often left incomplete. Opt for missions involving territory towers or temple captures during corresponding events to capitalize on ample support.</li>\n<li>Concerning rallies - certain structures like monster fortresses necessitate a rally for synchronized attacks due to their difficulty for a single player. Any alliance member can initiate a rally, while others can join and support using matching troop types. Damaged rally troops can be reinforced by sending the same troop type, known as \"refueling.\"</li>\n<li>The Bonion event spans approximately 4 days, divided into stages with escalating rewards. The most effective strategy involves progressing through stages using your maximum operable troops. If you get stuck, consider rallying for assistance. There are no shortcuts; simply utilize your highest potential troops to clear stages.</li>\n</ul>\n</div>\n<div class=\"container\">\n<h1>★★★★★(Important)</h1>\n<p>The Apex Predator event stands out as the most significant, spanning 5 days and encompassing various categories of competition. The cumulative score you achieve determines your final rewards, which notably include Elisha manastone.</p>\n<p>Even participants in lower ranks receive rewards, but securing a spot within the top 15 is necessary to gain a substantial chance at obtaining Elisha's manastone.</p>\n<p>For this event, it's prudent to save up accelerators, resources, training, research, and alliance accelerators for a substantial push when you're fully prepared. Aim to accumulate around 200-300 days' worth of each resource.</p>\n<p>Paying players tend to recruit heavily on day 1 to secure an easy 1st place. Free players, on the other hand, should assess the feasibility of reaching the top 15 and then commit to a determined effort if the goal is attainable.</p>\n</div>",
            "author": {
                "name": "Thundas"
            },
            "tags": [
            ],
            "date_published": "2023-08-26T13:06:01+08:00",
            "date_modified": "2023-08-26T14:31:26+08:00"
        }
    ]
}
